16-Rails-Intro/app/controllers/movies_controller.rb

    def show
        # byebug
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]