33-rails-api/app/views/instructors/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."instructor_id" = ?  [["instructor_id", 1]]
---
<h4>Students</h4>
<% @instructor.students.each do |student|%>