17-Rails-Forms/app/controllers/movies_controller.rb

    def create
    # byebug
        movie = Movie.create(movies_params)
---
INSERT INTO "movies" ("title", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "harry p2"], ["year", 2010], ["created_at", "2020-02-24 22:27:21.408236"], ["updated_at", "2020-02-24 22:27:21.408236"]]

    def update
    # byebug
        # movie = Movie.find(params[:id])
        @movie.update(movies_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "harry"], ["updated_at", "2020-02-24 23:17:19.677774"], ["id", 8]]

    def destroy
        # byebug
        # movie = Movie.find(params[:id])
        @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 8]]

    def current_movie
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]