21-rails-review/app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors"
---
  def index
    @instructors = Instructor.all

INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Josh"], ["created_at", "2020-02-27 22:19:46.010312"], ["updated_at", "2020-02-27 22:19:46.010312"]]
---
  def create
    @instructor = Instructor.new(instructor_params)

    if @instructor.valid?
      @instructor.save

UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Joshua"], ["updated_at", "2020-02-28 00:59:44.707141"], ["id", 4]]
---
  def update
    if @instructor.update(instructor_params)

DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 5]]
---
  def destroy
    @instructor.destroy

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_instructor
    @instructor = Instructor.find(params[:id])