21-rails-review/app/controllers/students_controller.rb

    def new
        @student = Student.new
        @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

    def create
    # byebug
        @student = Student.new(student_params)

        if @student.valid?
            @student.save
---
INSERT INTO "students" ("name", "major", "age", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Vidhi Sharma"], ["major", "SE"], ["age", 25], ["instructor_id", 4], ["created_at", "2020-02-28 01:23:30.381204"], ["updated_at", "2020-02-28 01:23:30.381204"]]

    def edit
        @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

    def update
        if @student.update(student_params)
---
UPDATE "students" SET "instructor_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["instructor_id", 2], ["updated_at", "2020-02-28 01:27:56.521709"], ["id", 7]]