22-session-cookies/app/controllers/responses_controller.rb

SELECT "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
---
    def define_question
        @question = Question.order("RANDOM()").limit(1)[0]

INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 2], ["answer_id", 7], ["created_at", "2020-03-02 16:47:40.446975"], ["updated_at", "2020-03-02 16:47:40.446975"]]
---
    def create
        if session[:number_correct] == nil
            session[:number_correct] = 0
        end
        response = Response.create(response_params)