20-rails-validations/app/views/movies/show.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."movie_id" = ?  [["movie_id", 1]]
---

<% @movie.characters.each do |character| %>

SELECT "actors".* FROM "actors" INNER JOIN "characters" ON "actors"."id" = "characters"."actor_id" WHERE "characters"."movie_id" = ?  [["movie_id", 6]]
---

<% @movie.actors.each do |actor| %>