19-rails-many-many/app/controllers/characters_controller.rb

SELECT "movies".* FROM "movies"
---
  def new
    @character = Character.new
    @movies = Movie.all

INSERT INTO "characters" ("name", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["movie_id", 16], ["created_at", "2020-02-25 16:52:24.673307"], ["updated_at", "2020-02-25 16:52:24.673307"]]
---
  def create
    character = Character.create(character_params)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "movies".* FROM "movies"
---
  def edit
    @character = Character.find(params[:id])
    @movies = Movie.all