19-rails-many-many/app/controllers/movies_controller.rb

    def create
        movie = Movie.create(movies_params)
---
INSERT INTO "movies" ("title", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "harry p2"], ["year", 2010], ["created_at", "2020-02-24 22:27:21.408236"], ["updated_at", "2020-02-24 22:27:21.408236"]]

    def update
        @movie.update(movies_params)
---
UPDATE "movies" SET "year" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["year", 2011], ["updated_at", "2020-02-24 22:53:57.762314"], ["id", 9]]

    def current_movie
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]