33-rails-api/app/controllers/api/v1/instructors_controller.rb

  def index
    @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"