23-rails-auth/app/controllers/sessions_controller.rb

    def create
    # byebug
    @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "vidhi03"], ["LIMIT", 1]]