23-rails-auth/app/controllers/users_controller.rb

    def create
    # byebug
    @user = User.new(user_params)

        if @user.valid?
            @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def show
        # byebug
        if session[:user_id] == params[:id].to_i
            @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]