44-JWT-auth/server/app/controllers/application_controller.rb

    def logged_in?
        # byebug
        headers = request.headers["Authorization"]
        token = headers.split(" ")[1]
        # byebug
        begin
            user_id = JWT.decode(token, "se012720")[0]["user_id"]
            user = User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]